adafruit/circuitpython/ports/nxp/driver/fsl_cmsis/LPC55S28/fsl_gpio_cmsis.c
/*
 * Copyright 2020 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
#include "fsl_gpio_cmsis.h"
#include "fsl_gpio.h"
#include "fsl_pint.h"

/* Component ID definition, used by tools. */
#ifndef FSL_COMPONENT_ID
#define FSL_COMPONENT_ID "platform.drivers.lpc_gpio_cmsis"
#endif

#if defined(GPIO) && ((defined(RTE_GPIO_PORT0) && RTE_GPIO_PORT0) || (defined(RTE_GPIO_PORT1) && RTE_GPIO_PORT1))

/*!
 * @brief Status of the GPIO inteface
 *
 */
typedef struct _gpio_cmsis_status
{
    bool is_inited;
} gpio_cmsis_status_t;

/*!
 * @brief Type define for the pin state variable
 *
 */
typedef uint32_t gpio_cmsis_pin_state_t;

/*!
 * @brief Map structure between GPIO pin and PINT instance
 *
 */
typedef struct _gpio_cmsis_map
{
    uint32_t pin_index;
    pint_pin_int_t pint_index;
    void (*pinmux_init_func)(void);
    void (*pinmux_deinit_func)(void);
} gpio_cmsis_map_t;

/*!
 * @brief Configuration for CMSIS GPIO Inteface instance
 *
 */
typedef struct _gpio_cmsis_config
{
    GPIO_Type *gpio_base;
    PINT_Type *pint_base;
    uint8_t port_index;
    uint8_t size_of_map;
    uint8_t size_of_context;
} gpio_cmsis_config_t;

/*!
 * @brief Context for GPIO with interrupt enabled
 *
 */
typedef struct _gpio_cmsis_contexts
{
    bool is_occupied;
    uint8_t pin_index;
    pint_pin_int_t pint_index;
    ARM_GPIO_SignalEvent_t callback;
} gpio_cmsis_context_t;

/*!
 * @brief Handle for CMSIS GPIO inteface instance
 *
 */
typedef struct _gpio_cmsis_handle
{
    gpio_cmsis_config_t const *config;
    gpio_cmsis_status_t status;
    gpio_cmsis_pin_state_t interrupt_pins;
    gpio_cmsis_context_t *contexts;
    gpio_cmsis_map_t const *maps;
} gpio_cmsis_handle_t;

/*
 * CMSIS GPIO Version
 */
#define ARM_CMSIS_GPIO_DRV_VERSION ARM_DRIVER_VERSION_MAJOR_MINOR(1U, 0U) /* driver version */

/* Driver Version */
static const ARM_DRIVER_VERSION s_gpioDriverVersion = {ARM_GPIO_API_VERSION, ARM_CMSIS_GPIO_DRV_VERSION};

/* Driver Capabilities */
static const ARM_GPIO_CAPABILITIES s_gpioDriverCapabilities = {
    1, /* IRQ Supported */
};

/*
 * ARMCC does not support split the data section automatically, so the driver
 * needs to split the data to separate sections explicitly, to reduce codesize.
 */
#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
#define ARMCC_SECTION(section_name) __attribute__((section(section_name)))
#endif /* defined(__CC_ARM) || defined(__ARMCC_VERSION) */

static gpio_cmsis_map_t const *CMSIS_GPIO_GetMapResource(gpio_cmsis_handle_t *handle, uint32_t pin) {
    for (uint32_t i = 0; i < handle->config->size_of_map; i++)
    {
        if (pin == handle->maps[i].pin_index) {
            return &(handle->maps[i]);
        }
    }

    return NULL;
}

static gpio_cmsis_context_t *CMSIS_GPIO_GetContextResource(gpio_cmsis_handle_t *handle, uint32_t pintr) {
    for (uint32_t i = 0; i < handle->config->size_of_context; i++)
    {
        gpio_cmsis_context_t *cxt = &(handle->contexts[i]);

        if (cxt->is_occupied == false) {
            continue;
        }

        if ((pintr == (uint32_t)cxt->pint_index)) {
            return cxt;
        }
    }

    return NULL;
}

static gpio_cmsis_context_t *CMSIS_GPIO_GetEmptyContext(gpio_cmsis_handle_t *handle) {
    for (uint32_t i = 0; i < handle->config->size_of_context; i++)
    {
        gpio_cmsis_context_t *cxt = &(handle->contexts[i]);

        if (cxt->is_occupied == false) {
            return cxt;
        }
    }

    return NULL;
}

static pint_pin_enable_t CMSIS_GPIO_MapIRQTypeToPINTType(uint32_t irq_type) {
    pint_pin_enable_t pin_type = kPINT_PinIntEnableNone;

    switch (irq_type)
    {
        case ARM_GPIO_INTERRUPT_DISABLE:
            pin_type = kPINT_PinIntEnableNone;
            break;
        case ARM_GPIO_INTERRUPT_LOGIC_ONE:
            pin_type = kPINT_PinIntEnableHighLevel;
            break;
        case ARM_GPIO_INTERRUPT_LOGIC_ZERO:
            pin_type = kPINT_PinIntEnableLowLevel;
            break;
        case ARM_GPIO_INTERRUPT_RISING_EDGE:
            pin_type = kPINT_PinIntEnableRiseEdge;
            break;
        case ARM_GPIO_INTERRUPT_FALLING_EDGE:
            pin_type = kPINT_PinIntEnableFallEdge;
            break;
        case ARM_GPIO_INTERRUPT_RISING_FALLING_EDGE:
            pin_type = kPINT_PinIntEnableBothEdges;
            break;

        default:
            /* Must be one of the interrupt type above */
            assert(false);
            break;
    }

    return pin_type;
}

static int32_t CMSIS_GPIO_Initialize(gpio_cmsis_handle_t *handle) {
    if (handle->status.is_inited != true) {
        GPIO_PortInit(handle->config->gpio_base, handle->config->port_index);
        handle->status.is_inited = true;
    }

    return ARM_DRIVER_OK;
}

static int32_t CMSIS_GPIO_DeinitPin(gpio_cmsis_handle_t *handle, uint32_t pin) {
    /* Do pin MUX configuration if provided pinmux funciton */
    gpio_cmsis_map_t const *map = CMSIS_GPIO_GetMapResource(handle, pin);
    uint32_t mask = 0x01UL << pin;

    if ((map != NULL) && (map->pinmux_deinit_func != NULL)) {
        map->pinmux_deinit_func();
    }

    /* Disable Interrupt if interrupt is configured previously */
    if ((map != NULL) && (((handle->interrupt_pins & mask) != 0U))) {
        PINT_DisableCallbackByIndex(handle->config->pint_base, map->pint_index);
        /* Reset the software state */
        handle->interrupt_pins &= ~mask;
    }

    return ARM_DRIVER_OK;
}

static int32_t CMSIS_GPIO_Uninitialize(gpio_cmsis_handle_t *handle) {
    if (handle->status.is_inited == true) {
        for (uint32_t i = 0U; i < 8U * sizeof(gpio_cmsis_pin_state_t); i++)
        {
            (void)CMSIS_GPIO_DeinitPin(handle, i);
        }

        handle->status.is_inited = false;
    }

    return ARM_DRIVER_OK;
}

static int32_t CMSIS_GPIO_InitPinAsOutput(gpio_cmsis_handle_t *handle, uint32_t pin, uint32_t output_logic) {
    assert(handle->status.is_inited == true);

    /* Init Pin as output */
    gpio_pin_config_t pin_config = {kGPIO_DigitalOutput, (uint8_t)output_logic};
    GPIO_PinInit(handle->config->gpio_base, handle->config->port_index, pin, &pin_config);

