adafruit/circuitpython/ports/nxp/driver/fsl_cmsis/LPC55S28/fsl_gpio_cmsis.c
    /* Do pin MUX configuration if provided pinmux funciton */
    gpio_cmsis_map_t const *map = CMSIS_GPIO_GetMapResource(handle, pin);
    if ((map != NULL) && (map->pinmux_init_func != NULL)) {
        map->pinmux_init_func();
    }

    return ARM_DRIVER_OK;
}

static void CMSIS_GPIO_Callback(gpio_cmsis_handle_t *handle, pint_pin_int_t pintr, uint32_t pmatch_status) {
    /* Iterate all registered callback context */
    gpio_cmsis_context_t *cxt = CMSIS_GPIO_GetContextResource(handle, (uint32_t)pintr);

    if ((cxt != NULL) && (cxt->callback != NULL)) {
        cxt->callback(cxt->pin_index); // EVENT
    }
}

static int32_t CMSIS_GPIO_InitPinAsInput(gpio_cmsis_handle_t *handle,
    uint32_t pin,
    uint32_t irq_type,
    ARM_GPIO_SignalEvent_t cb_event,
    pint_cb_t pint_callback) {
    assert(handle->status.is_inited == true);

    gpio_cmsis_map_t const *map = CMSIS_GPIO_GetMapResource(handle, pin);

    /* Configure the interrupt */
    if (irq_type != ARM_GPIO_INTERRUPT_NONE) {
        /* Assert to remind user to provide the map between PORT and interrupt */
        if (map == NULL) {
            assert(false);
            return ARM_DRIVER_ERROR;
        }

        gpio_cmsis_context_t *cxt = CMSIS_GPIO_GetEmptyContext(handle);

        /* Make sure there are still empty slot for this pin interrupt */
        if (cxt == NULL) {
            return ARM_DRIVER_ERROR;
        }

        /* Fill the context data */
        cxt->is_occupied = true;
        cxt->pin_index = (uint8_t)pin;
        cxt->pint_index = map->pint_index;
        cxt->callback = cb_event;

        /* Set the state */
        handle->interrupt_pins |= 0x01UL << pin;

        /* Configure the PINT */
        PINT_PinInterruptConfig(handle->config->pint_base, map->pint_index, CMSIS_GPIO_MapIRQTypeToPINTType(irq_type),
            pint_callback);
        PINT_EnableCallbackByIndex(handle->config->pint_base, map->pint_index);
    }

    /* Do pin MUX configuration if provided pinmux funciton */
    if ((map != NULL) && (map->pinmux_init_func != NULL)) {
        map->pinmux_init_func();
    }

    return ARM_DRIVER_OK;
}

static int32_t CMSIS_GPIO_PowerControl(gpio_cmsis_handle_t *handle, ARM_POWER_STATE state) {
    assert(handle->status.is_inited == true);
    return ARM_DRIVER_OK;
}

static int32_t CMSIS_GPIO_PinWrite(gpio_cmsis_handle_t *handle, uint32_t pin, uint32_t logic_value) {
    assert(handle->status.is_inited == true);
    GPIO_PinWrite(handle->config->gpio_base, handle->config->port_index, pin, (uint8_t)logic_value);
    return ARM_DRIVER_OK;
}

static bool CMSIS_GPIO_PinRead(gpio_cmsis_handle_t *handle, uint32_t pin) {
    assert(handle->status.is_inited == true);
    return GPIO_PinRead(handle->config->gpio_base, handle->config->port_index, pin) != 0U;
}

static int32_t CMSIS_GPIO_PortToggle(gpio_cmsis_handle_t *handle, uint32_t ored_pins) {
    assert(handle->status.is_inited == true);
    GPIO_PortToggle(handle->config->gpio_base, handle->config->port_index, ored_pins);
    return ARM_DRIVER_OK;
}

static int32_t CMSIS_GPIO_PinToggle(gpio_cmsis_handle_t *handle, uint32_t pin) {
    assert(handle->status.is_inited == true);
    return CMSIS_GPIO_PortToggle(handle, 0x01UL << pin);
}

static int32_t CMSIS_GPIO_PortWrite(gpio_cmsis_handle_t *handle, uint32_t ored_pins, uint32_t logic_value) {
    assert(handle->status.is_inited == true);
    if (logic_value == 0U) {
        GPIO_PortClear(handle->config->gpio_base, handle->config->port_index, ored_pins);
    } else {
        GPIO_PortSet(handle->config->gpio_base, handle->config->port_index, ored_pins);
    }
    return ARM_DRIVER_OK;
}

static uint32_t CMSIS_GPIO_PortRead(gpio_cmsis_handle_t *handle) {
    assert(handle->status.is_inited == true);
    return GPIO_PortRead(handle->config->gpio_base, handle->config->port_index);
}

static int32_t CMSIS_GPIO_Control(gpio_cmsis_handle_t *handle, uint32_t pin, uint32_t control, uint32_t arg) {
    assert(handle->status.is_inited == true);
    int32_t returncode = ARM_DRIVER_OK;

    switch (control)
    {
        case ARM_GPIO_CONTROL_INTERRUPT: {
            gpio_cmsis_map_t const *map = CMSIS_GPIO_GetMapResource(handle, pin);

            if (map == NULL) {
                returncode = ARM_DRIVER_ERROR_PARAMETER;
            } else {
                switch (arg)
                {
                    case ARM_GPIO_INTERRUPT_DISABLE:
                        PINT_DisableCallbackByIndex(handle->config->pint_base, map->pint_index);
                        break;

                    case ARM_GPIO_INTERRUPT_ENABLE:
                        PINT_EnableCallbackByIndex(handle->config->pint_base, map->pint_index);
                        break;

                    default:
                        returncode = ARM_DRIVER_ERROR_PARAMETER;
                        break;
                }
            }
            break;
        }

        default:
            returncode = ARM_DRIVER_ERROR_PARAMETER;
            break;
    }
    return returncode;
}

static ARM_DRIVER_VERSION CMSIS_GPIO_GetVersion(void) {
    return s_gpioDriverVersion;
}

static ARM_GPIO_CAPABILITIES CMSIS_GPIO_GetCapabilities(void) {
    return s_gpioDriverCapabilities;
}

#endif // (RTE_GPIO_PORT0 && defined(GPIO)) || (RTE_GPIO_PORT1 && defined(GPIO))

/******************************* GPIO PORT 0 **********************************************/
#if defined(GPIO) && defined(RTE_GPIO_PORT0) && RTE_GPIO_PORT0
static const gpio_cmsis_map_t s_gpio_port0_cmsis_maps[] = RTE_GPIO_PORT0_MAPS;

static const gpio_cmsis_config_t s_gpio_port0_cmsis_config = {
    .gpio_base = GPIO,
    .pint_base = PINT,
    .port_index = 0,
    .size_of_map = RTE_GPIO_PORT0_SIZE_OF_MAP,
    .size_of_context = RTE_GPIO_PORT0_MAX_INTERRUPT_CONTEXTS,
};

static gpio_cmsis_context_t s_gpio_port0_contexts[RTE_GPIO_PORT0_MAX_INTERRUPT_CONTEXTS];

static gpio_cmsis_handle_t s_gpio_port0_handle = {
    .config = &s_gpio_port0_cmsis_config,
    .maps = s_gpio_port0_cmsis_maps,
    .status = {0},
    .interrupt_pins = 0x0U,
    .contexts = s_gpio_port0_contexts,
};

static int32_t GPIO_PORT0_Initialize(void) {
    return CMSIS_GPIO_Initialize(&s_gpio_port0_handle);
}

static int32_t GPIO_PORT0_Uninitialize(void) {
    return CMSIS_GPIO_Uninitialize(&s_gpio_port0_handle);
}

static int32_t GPIO_PORT0_InitPinAsOutput(uint32_t pin, uint32_t output_logic) {
    return CMSIS_GPIO_InitPinAsOutput(&s_gpio_port0_handle, pin, output_logic);
}

static void GPIO_PORT0_Callback(pint_pin_int_t pintr, uint32_t pmatch_status) {
    CMSIS_GPIO_Callback(&s_gpio_port0_handle, pintr, pmatch_status);
}

static int32_t GPIO_PORT0_InitPinAsInput(uint32_t pin, uint32_t irq_type, ARM_GPIO_SignalEvent_t cb_event) {
    return CMSIS_GPIO_InitPinAsInput(&s_gpio_port0_handle, pin, irq_type, cb_event, GPIO_PORT0_Callback);
}

