adafruit/circuitpython/ports/nxp/driver/fsl_cmsis/LPC55S28/fsl_gpio_cmsis.c
static int32_t GPIO_PORT0_PowerControl(ARM_POWER_STATE state) {
    return CMSIS_GPIO_PowerControl(&s_gpio_port0_handle, state);
}

static int32_t GPIO_PORT0_PinWrite(uint32_t pin, uint32_t logic_value) {
    return CMSIS_GPIO_PinWrite(&s_gpio_port0_handle, pin, logic_value);
}

static int32_t GPIO_PORT0_PinToggle(uint32_t pin) {
    return CMSIS_GPIO_PinToggle(&s_gpio_port0_handle, pin);
}

static bool GPIO_PORT0_PinRead(uint32_t pin) {
    return CMSIS_GPIO_PinRead(&s_gpio_port0_handle, pin);
}

static int32_t GPIO_PORT0_PortWrite(uint32_t ored_pins, uint32_t logic_value) {
    return CMSIS_GPIO_PortWrite(&s_gpio_port0_handle, ored_pins, logic_value);
}

static int32_t GPIO_PORT0_PortToggle(uint32_t ored_pins) {
    return CMSIS_GPIO_PortToggle(&s_gpio_port0_handle, ored_pins);
}

static uint32_t GPIO_PORT0_PortRead(void) {
    return CMSIS_GPIO_PortRead(&s_gpio_port0_handle);
}

static int32_t GPIO_PORT0_Control(uint32_t pin, uint32_t control, uint32_t arg) {
    return CMSIS_GPIO_Control(&s_gpio_port0_handle, pin, control, arg);
}

ARM_DRIVER_GPIO Driver_GPIO_PORT0 = {
    .GetVersion = CMSIS_GPIO_GetVersion,
    .GetCapabilities = CMSIS_GPIO_GetCapabilities,
    .Initialize = GPIO_PORT0_Initialize,
    .Uninitialize = GPIO_PORT0_Uninitialize,
    .InitPinAsOutput = GPIO_PORT0_InitPinAsOutput,
    .InitPinAsInput = GPIO_PORT0_InitPinAsInput,
    .PowerControl = GPIO_PORT0_PowerControl,
    .PinWrite = GPIO_PORT0_PinWrite,
    .PinRead = GPIO_PORT0_PinRead,
    .PinToggle = GPIO_PORT0_PinToggle,
    .PortWrite = GPIO_PORT0_PortWrite,
    .PortToggle = GPIO_PORT0_PortToggle,
    .PortRead = GPIO_PORT0_PortRead,
    .Control = GPIO_PORT0_Control,
};
#endif

#if defined(GPIO) && RTE_GPIO_PORT1
static const gpio_cmsis_map_t s_gpio_port1_cmsis_maps[] = RTE_GPIO_PORT1_MAPS;

static const gpio_cmsis_config_t s_gpio_port1_cmsis_config = {
    .gpio_base = GPIO,
    .pint_base = PINT,
    .port_index = 1,
    .size_of_map = RTE_GPIO_PORT1_SIZE_OF_MAP,
    .size_of_context = RTE_GPIO_PORT1_MAX_INTERRUPT_CONTEXTS,
};

static gpio_cmsis_context_t s_gpio_port1_contexts[RTE_GPIO_PORT1_MAX_INTERRUPT_CONTEXTS];

static gpio_cmsis_handle_t s_gpio_port1_handle = {
    .config = &s_gpio_port1_cmsis_config,
    .maps = s_gpio_port1_cmsis_maps,
    .status = {0},
    .interrupt_pins = 0x0U,
    .contexts = s_gpio_port1_contexts,
};

static int32_t GPIO_PORT1_Initialize(void) {
    return CMSIS_GPIO_Initialize(&s_gpio_port1_handle);
}

static int32_t GPIO_PORT1_Uninitialize(void) {
    return CMSIS_GPIO_Uninitialize(&s_gpio_port1_handle);
}

static int32_t GPIO_PORT1_InitPinAsOutput(uint32_t pin, uint32_t output_logic) {
    return CMSIS_GPIO_InitPinAsOutput(&s_gpio_port1_handle, pin, output_logic);
}

static void GPIO_PORT1_Callback(pint_pin_int_t pintr, uint32_t pmatch_status) {
    CMSIS_GPIO_Callback(&s_gpio_port1_handle, pintr, pmatch_status);
}

static int32_t GPIO_PORT1_InitPinAsInput(uint32_t pin, uint32_t irq_type, ARM_GPIO_SignalEvent_t cb_event) {
    return CMSIS_GPIO_InitPinAsInput(&s_gpio_port1_handle, pin, irq_type, cb_event, GPIO_PORT1_Callback);
}

static int32_t GPIO_PORT1_PowerControl(ARM_POWER_STATE state) {
    return CMSIS_GPIO_PowerControl(&s_gpio_port1_handle, state);
}

static int32_t GPIO_PORT1_PinWrite(uint32_t pin, uint32_t logic_value) {
    return CMSIS_GPIO_PinWrite(&s_gpio_port1_handle, pin, logic_value);
}

static int32_t GPIO_PORT1_PinToggle(uint32_t pin) {
    return CMSIS_GPIO_PinToggle(&s_gpio_port1_handle, pin);
}

static bool GPIO_PORT1_PinRead(uint32_t pin) {
    return CMSIS_GPIO_PinRead(&s_gpio_port1_handle, pin);
}

static int32_t GPIO_PORT1_PortWrite(uint32_t ored_pins, uint32_t logic_value) {
    return CMSIS_GPIO_PortWrite(&s_gpio_port1_handle, ored_pins, logic_value);
}

static int32_t GPIO_PORT1_PortToggle(uint32_t ored_pins) {
    return CMSIS_GPIO_PortToggle(&s_gpio_port1_handle, ored_pins);
}

static uint32_t GPIO_PORT1_PortRead(void) {
    return CMSIS_GPIO_PortRead(&s_gpio_port1_handle);
}

static int32_t GPIO_PORT1_Control(uint32_t pin, uint32_t control, uint32_t arg) {
    return CMSIS_GPIO_Control(&s_gpio_port1_handle, pin, control, arg);
}

ARM_DRIVER_GPIO Driver_GPIO_PORT1 = {
    .GetVersion = CMSIS_GPIO_GetVersion,
    .GetCapabilities = CMSIS_GPIO_GetCapabilities,
    .Initialize = GPIO_PORT1_Initialize,
    .Uninitialize = GPIO_PORT1_Uninitialize,
    .InitPinAsOutput = GPIO_PORT1_InitPinAsOutput,
    .InitPinAsInput = GPIO_PORT1_InitPinAsInput,
    .PowerControl = GPIO_PORT1_PowerControl,
    .PinWrite = GPIO_PORT1_PinWrite,
    .PinRead = GPIO_PORT1_PinRead,
    .PinToggle = GPIO_PORT1_PinToggle,
    .PortWrite = GPIO_PORT1_PortWrite,
    .PortToggle = GPIO_PORT1_PortToggle,
    .PortRead = GPIO_PORT1_PortRead,
    .Control = GPIO_PORT1_Control,
};

#endif

#if defined(GPIO) && defined(RTE_GPIO_PORT2) && RTE_GPIO_PORT2
static const gpio_cmsis_map_t s_gpio_port2_cmsis_maps[] = RTE_GPIO_PORT2_MAPS;

static const gpio_cmsis_config_t s_gpio_port2_cmsis_config = {
    .gpio_base = GPIO,
    .pint_base = PINT,
    .port_index = 2,
    .size_of_map = RTE_GPIO_PORT2_SIZE_OF_MAP,
    .size_of_context = RTE_GPIO_PORT2_MAX_INTERRUPT_CONTEXTS,
};

static gpio_cmsis_context_t s_gpio_port2_contexts[RTE_GPIO_PORT2_MAX_INTERRUPT_CONTEXTS];

static gpio_cmsis_handle_t s_gpio_port2_handle = {
    .config = &s_gpio_port2_cmsis_config,
    .maps = s_gpio_port2_cmsis_maps,
    .status = {0},
    .interrupt_pins = 0x0U,
    .contexts = s_gpio_port2_contexts,
};

static int32_t GPIO_PORT2_Initialize(void) {
    return CMSIS_GPIO_Initialize(&s_gpio_port2_handle);
}

static int32_t GPIO_PORT2_Uninitialize(void) {
    return CMSIS_GPIO_Uninitialize(&s_gpio_port2_handle);
}

static int32_t GPIO_PORT2_InitPinAsOutput(uint32_t pin, uint32_t output_logic) {
    return CMSIS_GPIO_InitPinAsOutput(&s_gpio_port2_handle, pin, output_logic);
}

static void GPIO_PORT2_Callback(pint_pin_int_t pintr, uint32_t pmatch_status) {
    CMSIS_GPIO_Callback(&s_gpio_port2_handle, pintr, pmatch_status);
}

static int32_t GPIO_PORT2_InitPinAsInput(uint32_t pin, uint32_t irq_type, ARM_GPIO_SignalEvent_t cb_event) {
    return CMSIS_GPIO_InitPinAsInput(&s_gpio_port2_handle, pin, irq_type, cb_event, GPIO_PORT2_Callback);
}

static int32_t GPIO_PORT2_PowerControl(ARM_POWER_STATE state) {
    return CMSIS_GPIO_PowerControl(&s_gpio_port2_handle, state);
}

static int32_t GPIO_PORT2_PinWrite(uint32_t pin, uint32_t logic_value) {
    return CMSIS_GPIO_PinWrite(&s_gpio_port2_handle, pin, logic_value);
}

