adafruit/circuitpython/ports/nxp/driver/fsl_cmsis/LPC55S28/fsl_gpio_cmsis.c
static int32_t GPIO_PORT2_PinToggle(uint32_t pin) {
    return CMSIS_GPIO_PinToggle(&s_gpio_port2_handle, pin);
}

static bool GPIO_PORT2_PinRead(uint32_t pin) {
    return CMSIS_GPIO_PinRead(&s_gpio_port2_handle, pin);
}

static int32_t GPIO_PORT2_PortWrite(uint32_t ored_pins, uint32_t logic_value) {
    return CMSIS_GPIO_PortWrite(&s_gpio_port2_handle, ored_pins, logic_value);
}

static int32_t GPIO_PORT2_PortToggle(uint32_t ored_pins) {
    return CMSIS_GPIO_PortToggle(&s_gpio_port2_handle, ored_pins);
}

static uint32_t GPIO_PORT2_PortRead(void) {
    return CMSIS_GPIO_PortRead(&s_gpio_port2_handle);
}

static int32_t GPIO_PORT2_Control(uint32_t pin, uint32_t control, uint32_t arg) {
    return CMSIS_GPIO_Control(&s_gpio_port2_handle, pin, control, arg);
}

ARM_DRIVER_GPIO Driver_GPIO_PORT2 = {
    .GetVersion = CMSIS_GPIO_GetVersion,
    .GetCapabilities = CMSIS_GPIO_GetCapabilities,
    .Initialize = GPIO_PORT2_Initialize,
    .Uninitialize = GPIO_PORT2_Uninitialize,
    .InitPinAsOutput = GPIO_PORT2_InitPinAsOutput,
    .InitPinAsInput = GPIO_PORT2_InitPinAsInput,
    .PowerControl = GPIO_PORT2_PowerControl,
    .PinWrite = GPIO_PORT2_PinWrite,
    .PinRead = GPIO_PORT2_PinRead,
    .PinToggle = GPIO_PORT2_PinToggle,
    .PortWrite = GPIO_PORT2_PortWrite,
    .PortToggle = GPIO_PORT2_PortToggle,
    .PortRead = GPIO_PORT2_PortRead,
    .Control = GPIO_PORT2_Control,
};

#endif

#if defined(GPIO) && defined(RTE_GPIO_PORT3) && RTE_GPIO_PORT3
static const gpio_cmsis_map_t s_gpio_port3_cmsis_maps[] = RTE_GPIO_PORT3_MAPS;

static const gpio_cmsis_config_t s_gpio_port3_cmsis_config = {
    .gpio_base = GPIO,
    .pint_base = PINT,
    .port_index = 3,
    .size_of_map = RTE_GPIO_PORT3_SIZE_OF_MAP,
    .size_of_context = RTE_GPIO_PORT3_MAX_INTERRUPT_CONTEXTS,
};

static gpio_cmsis_context_t s_gpio_port3_contexts[RTE_GPIO_PORT3_MAX_INTERRUPT_CONTEXTS];

static gpio_cmsis_handle_t s_gpio_port3_handle = {
    .config = &s_gpio_port3_cmsis_config,
    .maps = s_gpio_port3_cmsis_maps,
    .status = {0},
    .interrupt_pins = 0x0U,
    .contexts = s_gpio_port3_contexts,
};

static int32_t GPIO_PORT3_Initialize(void) {
    return CMSIS_GPIO_Initialize(&s_gpio_port3_handle);
}

static int32_t GPIO_PORT3_Uninitialize(void) {
    return CMSIS_GPIO_Uninitialize(&s_gpio_port3_handle);
}

static int32_t GPIO_PORT3_InitPinAsOutput(uint32_t pin, uint32_t output_logic) {
    return CMSIS_GPIO_InitPinAsOutput(&s_gpio_port3_handle, pin, output_logic);
}

static void GPIO_PORT3_Callback(pint_pin_int_t pintr, uint32_t pmatch_status) {
    CMSIS_GPIO_Callback(&s_gpio_port3_handle, pintr, pmatch_status);
}

static int32_t GPIO_PORT3_InitPinAsInput(uint32_t pin, uint32_t irq_type, ARM_GPIO_SignalEvent_t cb_event) {
    return CMSIS_GPIO_InitPinAsInput(&s_gpio_port3_handle, pin, irq_type, cb_event, GPIO_PORT3_Callback);
}

static int32_t GPIO_PORT3_PowerControl(ARM_POWER_STATE state) {
    return CMSIS_GPIO_PowerControl(&s_gpio_port3_handle, state);
}

static int32_t GPIO_PORT3_PinWrite(uint32_t pin, uint32_t logic_value) {
    return CMSIS_GPIO_PinWrite(&s_gpio_port3_handle, pin, logic_value);
}

static int32_t GPIO_PORT3_PinToggle(uint32_t pin) {
    return CMSIS_GPIO_PinToggle(&s_gpio_port3_handle, pin);
}

static bool GPIO_PORT3_PinRead(uint32_t pin) {
    return CMSIS_GPIO_PinRead(&s_gpio_port3_handle, pin);
}

static int32_t GPIO_PORT3_PortWrite(uint32_t ored_pins, uint32_t logic_value) {
    return CMSIS_GPIO_PortWrite(&s_gpio_port3_handle, ored_pins, logic_value);
}

static int32_t GPIO_PORT3_PortToggle(uint32_t ored_pins) {
    return CMSIS_GPIO_PortToggle(&s_gpio_port3_handle, ored_pins);
}

static uint32_t GPIO_PORT3_PortRead(void) {
    return CMSIS_GPIO_PortRead(&s_gpio_port3_handle);
}

static int32_t GPIO_PORT3_Control(uint32_t pin, uint32_t control, uint32_t arg) {
    return CMSIS_GPIO_Control(&s_gpio_port3_handle, pin, control, arg);
}

ARM_DRIVER_GPIO Driver_GPIO_PORT3 = {
    .GetVersion = CMSIS_GPIO_GetVersion,
    .GetCapabilities = CMSIS_GPIO_GetCapabilities,
    .Initialize = GPIO_PORT3_Initialize,
    .Uninitialize = GPIO_PORT3_Uninitialize,
    .InitPinAsOutput = GPIO_PORT3_InitPinAsOutput,
    .InitPinAsInput = GPIO_PORT3_InitPinAsInput,
    .PowerControl = GPIO_PORT3_PowerControl,
    .PinWrite = GPIO_PORT3_PinWrite,
    .PinRead = GPIO_PORT3_PinRead,
    .PinToggle = GPIO_PORT3_PinToggle,
    .PortWrite = GPIO_PORT3_PortWrite,
    .PortToggle = GPIO_PORT3_PortToggle,
    .PortRead = GPIO_PORT3_PortRead,
    .Control = GPIO_PORT3_Control,
};

#endif

#if defined(GPIO) && defined(RTE_GPIO_PORT4) && RTE_GPIO_PORT4
static const gpio_cmsis_map_t s_gpio_port4_cmsis_maps[] = RTE_GPIO_PORT4_MAPS;

static const gpio_cmsis_config_t s_gpio_port4_cmsis_config = {
    .gpio_base = GPIO,
    .pint_base = PINT,
    .port_index = 4,
    .size_of_map = RTE_GPIO_PORT4_SIZE_OF_MAP,
    .size_of_context = RTE_GPIO_PORT4_MAX_INTERRUPT_CONTEXTS,
};

static gpio_cmsis_context_t s_gpio_port4_contexts[RTE_GPIO_PORT4_MAX_INTERRUPT_CONTEXTS];

static gpio_cmsis_handle_t s_gpio_port4_handle = {
    .config = &s_gpio_port4_cmsis_config,
    .maps = s_gpio_port4_cmsis_maps,
    .status = {0},
    .interrupt_pins = 0x0U,
    .contexts = s_gpio_port4_contexts,
};

static int32_t GPIO_PORT4_Initialize(void) {
    return CMSIS_GPIO_Initialize(&s_gpio_port4_handle);
}

static int32_t GPIO_PORT4_Uninitialize(void) {
    return CMSIS_GPIO_Uninitialize(&s_gpio_port4_handle);
}

static int32_t GPIO_PORT4_InitPinAsOutput(uint32_t pin, uint32_t output_logic) {
    return CMSIS_GPIO_InitPinAsOutput(&s_gpio_port4_handle, pin, output_logic);
}

static void GPIO_PORT4_Callback(pint_pin_int_t pintr, uint32_t pmatch_status) {
    CMSIS_GPIO_Callback(&s_gpio_port4_handle, pintr, pmatch_status);
}

static int32_t GPIO_PORT4_InitPinAsInput(uint32_t pin, uint32_t irq_type, ARM_GPIO_SignalEvent_t cb_event) {
    return CMSIS_GPIO_InitPinAsInput(&s_gpio_port4_handle, pin, irq_type, cb_event, GPIO_PORT4_Callback);
}

static int32_t GPIO_PORT4_PowerControl(ARM_POWER_STATE state) {
    return CMSIS_GPIO_PowerControl(&s_gpio_port4_handle, state);
}

static int32_t GPIO_PORT4_PinWrite(uint32_t pin, uint32_t logic_value) {
    return CMSIS_GPIO_PinWrite(&s_gpio_port4_handle, pin, logic_value);
}

static int32_t GPIO_PORT4_PinToggle(uint32_t pin) {
    return CMSIS_GPIO_PinToggle(&s_gpio_port4_handle, pin);
}

static bool GPIO_PORT4_PinRead(uint32_t pin) {
    return CMSIS_GPIO_PinRead(&s_gpio_port4_handle, pin);
}

static int32_t GPIO_PORT4_PortWrite(uint32_t ored_pins, uint32_t logic_value) {
    return CMSIS_GPIO_PortWrite(&s_gpio_port4_handle, ored_pins, logic_value);
}

static int32_t GPIO_PORT4_PortToggle(uint32_t ored_pins) {
    return CMSIS_GPIO_PortToggle(&s_gpio_port4_handle, ored_pins);
}

static uint32_t GPIO_PORT4_PortRead(void) {
    return CMSIS_GPIO_PortRead(&s_gpio_port4_handle);
}

static int32_t GPIO_PORT4_Control(uint32_t pin, uint32_t control, uint32_t arg) {
    return CMSIS_GPIO_Control(&s_gpio_port4_handle, pin, control, arg);
}

ARM_DRIVER_GPIO Driver_GPIO_PORT4 = {
    .GetVersion = CMSIS_GPIO_GetVersion,
    .GetCapabilities = CMSIS_GPIO_GetCapabilities,
    .Initialize = GPIO_PORT4_Initialize,
    .Uninitialize = GPIO_PORT4_Uninitialize,
    .InitPinAsOutput = GPIO_PORT4_InitPinAsOutput,
    .InitPinAsInput = GPIO_PORT4_InitPinAsInput,
    .PowerControl = GPIO_PORT4_PowerControl,
    .PinWrite = GPIO_PORT4_PinWrite,
    .PinRead = GPIO_PORT4_PinRead,
    .PinToggle = GPIO_PORT4_PinToggle,
    .PortWrite = GPIO_PORT4_PortWrite,
    .PortToggle = GPIO_PORT4_PortToggle,
    .PortRead = GPIO_PORT4_PortRead,
    .Control = GPIO_PORT4_Control,
};

#endif

#if defined(GPIO) && defined(RTE_GPIO_PORT5) && RTE_GPIO_PORT5
const gpio_cmsis_map_t s_gpio_port5_cmsis_maps[] = RTE_GPIO_PORT5_MAPS;

const gpio_cmsis_config_t s_gpio_port5_cmsis_config = {
    .gpio_base = GPIO,
    .pint_base = PINT,
    .port_index = 5,
    .size_of_map = RTE_GPIO_PORT5_SIZE_OF_MAP,
    .size_of_context = RTE_GPIO_PORT5_MAX_INTERRUPT_CONTEXTS,
};

static gpio_cmsis_context_t s_gpio_port5_contexts[RTE_GPIO_PORT5_MAX_INTERRUPT_CONTEXTS];

static gpio_cmsis_handle_t s_gpio_port5_handle = {
    .config = &s_gpio_port5_cmsis_config,
    .maps = s_gpio_port5_cmsis_maps,
    .status = {0},
    .interrupt_pins = 0x0U,
    .contexts = s_gpio_port5_contexts,
};

