adafruit/circuitpython/ports/nxp/driver/fsl_cmsis/LPC55S28/fsl_gpio_cmsis.c
static int32_t GPIO_PORT5_Initialize(void) {
    return CMSIS_GPIO_Initialize(&s_gpio_port5_handle);
}

static int32_t GPIO_PORT5_Uninitialize(void) {
    return CMSIS_GPIO_Uninitialize(&s_gpio_port5_handle);
}

static int32_t GPIO_PORT5_InitPinAsOutput(uint32_t pin, uint32_t output_logic) {
    return CMSIS_GPIO_InitPinAsOutput(&s_gpio_port5_handle, pin, output_logic);
}

static void GPIO_PORT5_Callback(pint_pin_int_t pintr, uint32_t pmatch_status) {
    CMSIS_GPIO_Callback(&s_gpio_port5_handle, pintr, pmatch_status);
}

static int32_t GPIO_PORT5_InitPinAsInput(uint32_t pin, uint32_t irq_type, ARM_GPIO_SignalEvent_t cb_event) {
    return CMSIS_GPIO_InitPinAsInput(&s_gpio_port5_handle, pin, irq_type, cb_event, GPIO_PORT5_Callback);
}

static int32_t GPIO_PORT5_PowerControl(ARM_POWER_STATE state) {
    return CMSIS_GPIO_PowerControl(&s_gpio_port5_handle, state);
}

static int32_t GPIO_PORT5_PinWrite(uint32_t pin, uint32_t logic_value) {
    return CMSIS_GPIO_PinWrite(&s_gpio_port5_handle, pin, logic_value);
}

static int32_t GPIO_PORT5_PinToggle(uint32_t pin) {
    return CMSIS_GPIO_PinToggle(&s_gpio_port5_handle, pin);
}

static bool GPIO_PORT5_PinRead(uint32_t pin) {
    return CMSIS_GPIO_PinRead(&s_gpio_port5_handle, pin);
}

static int32_t GPIO_PORT5_PortWrite(uint32_t ored_pins, uint32_t logic_value) {
    return CMSIS_GPIO_PortWrite(&s_gpio_port5_handle, ored_pins, logic_value);
}

static int32_t GPIO_PORT5_PortToggle(uint32_t ored_pins) {
    return CMSIS_GPIO_PortToggle(&s_gpio_port5_handle, ored_pins);
}

static uint32_t GPIO_PORT5_PortRead(void) {
    return CMSIS_GPIO_PortRead(&s_gpio_port5_handle);
}

static int32_t GPIO_PORT5_Control(uint32_t pin, uint32_t control, uint32_t arg) {
    return CMSIS_GPIO_Control(&s_gpio_port5_handle, pin, control, arg);
}

ARM_DRIVER_GPIO Driver_GPIO_PORT5 = {
    .GetVersion = CMSIS_GPIO_GetVersion,
    .GetCapabilities = CMSIS_GPIO_GetCapabilities,
    .Initialize = GPIO_PORT5_Initialize,
    .Uninitialize = GPIO_PORT5_Uninitialize,
    .InitPinAsOutput = GPIO_PORT5_InitPinAsOutput,
    .InitPinAsInput = GPIO_PORT5_InitPinAsInput,
    .PowerControl = GPIO_PORT5_PowerControl,
    .PinWrite = GPIO_PORT5_PinWrite,
    .PinRead = GPIO_PORT5_PinRead,
    .PinToggle = GPIO_PORT5_PinToggle,
    .PortWrite = GPIO_PORT5_PortWrite,
    .PortToggle = GPIO_PORT5_PortToggle,
    .PortRead = GPIO_PORT5_PortRead,
    .Control = GPIO_PORT5_Control,
};

#endif
